{
  "architectures": [
    "GPT2LMHeadModel"
  ],
  "model_type": "gpt2",
  "vocab_size": 50257,
  "n_positions": 1024,
  "n_ctx": 1024,
  "n_embd": 1024,
  "n_layer": 24,
  "n_head": 16,
  "activation_function": "gelu_new",
  "resid_pdrop": 0.1,
  "embd_pdrop": 0.1,
  "attn_pdrop": 0.1,
  "layer_norm_epsilon": 1e-05,
  "initializer_range": 0.02,
  "summary_type": "cls_index",
  "summary_use_proj": true,
  "summary_activation": null,
  "summary_proj_to_labels": true,
  "summary_first_dropout": 0.1,
  "bos_token_id": 50256,
  "eos_token_id": 50256,
  "pad_token_id": 50256,
  "persona": "joe_rogan",
  "training_examples": 3066,
  "created": "2025-07-20T02:48:15.315098"
}